#### FaceBasedPlacementType Enumeration

---

|  |
| --- |
| See Also |

This enumerated type specifies options available for placement of a face-based family instance.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public enum FaceBasedPlacementType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration FaceBasedPlacementType ``` |

| Visual C++ |
| --- |
| ``` public enum class FaceBasedPlacementType ``` |

# Members

| Member name | Description |
| --- | --- |
| Default | Placement the instance which is not face-based. |
| PlaceOnVerticalFace | Placement on a vertical face. |
| PlaceOnFace | Placement on a selected face from existing geometry. |
| PlaceOnWorkPlane | Placement on current workplane. |

# See Also

Autodesk.Revit.UI Namespace